app/controllers/applications_controller.rb

  def index
    authorize! :read, Application
    @applications = Application.all.accessible_by(current_ability, :view)
---
SELECT "applications".* FROM "applications"

  def create
    @application = current_user.applications.new(application_params)

    respond_to do |format|
      if @application.save
---
INSERT INTO "applications" ("title", "description", "status", "user_id", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "web developer"], ["description", "qad"], ["status", 0], ["user_id", 2], ["job_id", 1], ["created_at", "2022-04-22 20:59:55.198934"], ["updated_at", "2022-04-22 20:59:55.198934"]]

    def set_application
      @application = Application.find(params[:id])
---
SELECT "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]