app/models/user.rb

  def has_role?(role_name)
    self.roles.pluck(:name).map(&:to_sym).include?(role_name.to_sym)
---
SELECT "roles"."name" FROM "roles" INNER JOIN "assignments" ON "roles"."id" = "assignments"."role_id" WHERE "assignments"."user_id" = ?  [["user_id", 1]]